<!DOCTYPE html>
<html>
 <head>
 <meta charset="utf-8">
 <meta name="author" content="">
 <link rel="stylesheet" href="estilo/pYsStyles.css">


 <title>Historia de la web</title>
 </head>
 <body>
    <header class="header">
        <div class="cabecera Inicio">  
            <a href="principal.html"><button class="logo" ><img src="imagenes/logo.png" alt="" ></button></a>
            <span class="menu-icono"><img src="../imagenes/abrirMenu1.png" alt=""></span>

            <nav class="navegador">
                <ul>
                    <li><a href="#inicio">Inicio</a></li>
                    <li><a href="historia.html">Historia</a></li>
                    <li><a href="cv.html">CV</a></li>
					<li><a href="video.html">Video</a></li>
					<li><a href="intereses.html">Intereses</a></li>
                    <li><a href="hobbies.html">Hobbies</a></li>
                </ul>
            </nav>
        </div>
    </header>
    <a name="inicio"><p style="color: transparent";>.</p></a>
    <br>


    <main class="main">
        <div class="cabecera">
            <a name="inicio"></a>
            <h2></h2>
        </div>
            <header class="header2">
                  
            </header>
        <div class="cabecera">
           
        </div>
        <div class="cabecera">
		<div class="timeline">    
        <h2>L&iacute;nea del Tiempo - Aplicaciones Web</h2>
		<div class="event8">
		<h3><a href="#mili">Era Militar</a></h3>
		<h3><a href="#nego">Era de los negocios</a></h3>
		<h3><a href="#person">Era de la computadora personal</a></h3>
		<h3><a href="#web1">WEB 1.0</a></h3>
		<h3><a href="#web2">WEB 2.0</a></h3>
		<h3><a href="#web3">WEB 3.0</a></h3>
		<h3><a href="#web4">WEB 4.0</a></h3>
		</div>
		
        <div class="event" id="mil|i">
            <h3>1945 - 1970: Era Militar</h3>
            <p>Primeros ordenadores con fines militares. Se desarrolla ARPANET, la primera red con conmutaci&oacute;n de paquetes.</p>
			<b>1946.</b>
			<p> Primera computadora electronica de prop&oacute;sito general, desarrollado en Pensilvania y principalmente usado para calcular tablas de artiller&iacute;a.</p>
			<b>1969.</b>
			<p>Fue desarrollada Arpanet por la Agencia de Proyectos de Investigaci&oacute;n Avanzada del Departamento de Defensa de Estados Unidos.
			Fue la primera red en utilizar la conmutaci&oacute;n de paquetes. Esto hizo que la red fuera m&aacute;s resistente a fallas. </p>
        </div>

        <div class="event2" id="nego">
            <h3>1970 - 1980: Era de los Negocios</h3>
            <p>Las computadoras comienzan a usarse en empresas para inventarios y n&oacute;minas, aunque su alto costo limita su adopci&oacute;n dom&eacute;stica.</p>
        </div>
		
		<div class="event3" id="person">
            <h3>1980 - 1990: Era de la computadora personal</h3>
			<p>Sus principales tecnologias eran los microprocesadores.Sistemas Operativos como MS-DOS y CP/M</p>
			<b>TCP/IP</b>
			<p>Es un conjunto de reglas que permiten la comunicaci&oacute;n entre dispositivos a trav&eacute;s de redes, como internet</p>
        </div>

        <div class="event4" id="web1">
            <h3>1991 - 2000: Web 1.0 (Sitios Est&aacute;ticos)</h3>
			<p>Es la forma m&aacute;s b&aacute;sica que existe, con navegadores de s&oacute;lo texto bastante r&aacute;pidos. Aqu&iacute; el usuario no puede interactuar con el contenido de la p&aacute;gina.</p>
            <b>1991. Word Wide Web</b>
            <p>Tim Berners Lee, crea la Word Wide Web mejor conocida como WWW. En la actualidad se sigue utilizando esta extensi&oacute;n.</p>
            <b>1993. Primera versi&oacute;n de HTML</b>
            <p>Hizo las p&aacute;ginas Web m&aacute;s agradables a la vista, as&iacute; como los primeros navegadores visuales como IE, Netscape, Explorer.</p>
            <b>HTML</b>
            <p>Sistema basado en hipertexto, que permite clasificar informaci&oacute;n de diversos tipos.</p>
            <b>1991. HTTP</b>
            <p>Protocolo de transferencia de hipertexto y permite las transferencias de informaci&oacute;n a trav&eacute;s de archivos. Con esto se facilita la comunicaci&oacute;n por la red.</p>
	</div>

			<div class="event5" id="web2">
				<h3>2004 - 2005: Web 2.0 (Web Social)</h3>
				<p>Tim O&apos;Reilly acu&ntilde;a el t&eacute;rmino Web 2.0.</p>
				<p>Aparecen plataformas como Facebook, YouTube y Wikipedia.</p>
				<p>Interactividad y contenido generado por el usuario.</p>
				<p>Uso de AJAX para aplicaciones m&aacute;s din&aacute;micas.</p>
				<p>Blogs, entornos para compartir recursos, plataformas educativas y aulas virtuales.</p>
				<p>Redes sociales como MySpace y LinkedIn.</p>
				<p>Napster y BitTorrent revolucionan el intercambio de archivos.</p>
				<p>Google AdSense y el modelo de publicidad Cost per Click.</p>
				<p>Impacto en la educaci&oacute;n: fomento del aprendizaje digital global.</p>
				<p>Impacto en la salud: acceso a informaci&oacute;n m&eacute;dica y concienciaci&oacute;n.</p>
				<p>Impacto en el comercio: inicio del e-commerce y publicidad digital.</p>
				<p>Impacto en la econom&iacute;a: creaci&oacute;n de empleo, apoyo a PYMEs y desarrollo social.</p>
     
			</div>

			<div class="event6" id="web3">
				<h3>2006 - 2014: Web 3.0 (Web Sem&aacute;ntica)</h3>
				<p>Tim Berners-Lee y James Hendler presentan la idea de la Web Sem&aacute;ntica.</p>
				<p>Uso de inteligencia artificial, blockchain y big data.</p>
				<p>En 2012, HTML5 se estandariza.</p>
				<p>En 2013 inicia el dise&ntilde;o responsivo.</p>
				<p>En 2014, HTML5 es publicado oficialmente por W3C.</p>
				<p>Uso de tecnolog&iacute;as clave como XML, RDF, OWL y WebAssembly.</p>
				<p>Aplicaciones descentralizadas y contratos inteligentes en Ethereum.</p>
				<p>Impacto en la educaci&oacute;n: personalizaci&oacute;n del aprendizaje y verificaci&oacute;n de credenciales con blockchain.</p>
				<p>Impacto en la salud: gesti&oacute;n descentralizada de datos m&eacute;dicos y telemedicina m&aacute;s segura.</p>
				<p>Impacto en el comercio: pagos seguros con criptomonedas y tokenizaci&oacute;n de productos.</p>
				<p>Impacto en el entretenimiento: monetizaci&oacute;n con NFTs y experiencias inmersivas con realidad aumentada y virtual.</p>
			</div>

			<div class="event7" id="web4">
				<h3>Actualidad: Web 4.0 (Web Inteligente)</h3>
				<p>Integraci&oacute;n de inteligencia artificial y asistentes virtuales (Siri, Alexa, Google Assistant).</p>
				<p>Procesamiento de lenguaje natural y aprendizaje autom&aacute;tico.</p>
				<p>Expansi&oacute;n del metaverso y computaci&oacute;n en la nube.</p>
				<p>Uso de blockchain y contratos inteligentes para seguridad y descentralizaci&oacute;n.</p>
				<p>Progresi&oacute;n hacia una web m&aacute;s personalizada e intuitiva.</p>
				<p>Avances en asistentes de voz con tecnolog&iacute;as como GPT y BERT.</p>
				<p>Computaci&oacute;n en la nube y procesamiento en tiempo real.</p>
				<p>Impacto en la educaci&oacute;n: aprendizaje adaptativo con IA y realidad aumentada.</p>
				<p>Impacto en la salud: diagn&oacute;sticos predictivos y asistencia m&eacute;dica en tiempo real.</p>
				<p>Impacto en el comercio: tiendas inteligentes con asistentes virtuales.</p>
				<p>Impacto en el entretenimiento: contenidos personalizados y experiencias inmersivas con IA y metaverso.</p>
			</div>
        </div>
    </main>
    <footer class="footer" >
        <div class="cabecera">
            <p>Historia de la web</p>
        </div>
    </footer>

    <script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
    <script src="../scripts.js"></script>
 </body>
 
</html>