<!DOCTYPE html>
<html>
 <head>
 <meta charset="utf-8">
 <meta name="author" content="">
 <link rel="stylesheet" href="estilo/blogStyle.css">

 <title>Hobbies</title>
 </head>
 <body>
    <header class="header">
        <div class="cabecera Inicio">  
            <a href="principal.html"><button class="logo" ><img src="imagenes/logo.png" alt="" ></button></a>
            <span class="menu-icono"><img src="../imagenes/abrirMenu1.png" alt=""></span>

            <nav class="navegador">
                <ul>
                    <li><a href="#inicio">Inicio</a></li>
                    <li><a href="historia.html">Historia</a></li>
                    <li><a href="cv.html">CV</a></li>
					<li><a href="video.html">Video</a></li>
					<li><a href="intereses.html">Intereses</a></li>
                    <li><a href="hobbies.html">Hobbies</a></li>
                </ul>
            </nav>
        </div>
    </header>
    <a name="inicio"><p style="color: transparent";>.</p></a>
    <br>
	
	<header>
	<img src="imagenes/hobbies.jpg" alt="Imagenhobbies" id="hobbies1" width=100% height= auto>
	</header>
    <main class="main">
        <section class="cabecera">
            
			<h2>Mis Hobbies y Pasiones</h2>
			<audio controls><source src="media/LuismiTenecesito.mp3" type="audio/mpeg"></audio>
            <p>Desde siempre, he sido una persona activa y creativa, encontrando satisfacci&oacute;n en diversas actividades que 
			van desde el deporte hasta la programaci&oacute;n. Cada uno de mis hobbies representa un aspecto importante 
			de mi personalidad y me permite explorar diferentes facetas de mi vida.</p>
			<a name="inicio"></a>
			
			
			
			<h2>1. F&uacute;bol</h2>
			<img src="imagenes/futbol.jpg" alt="Imagenfutbol" id="fut1" width=100% height= auto>
			<p>Me encanta jugar y ver partidos de futbol, La emoci&oacute;n de un partido y  el tiempo que pasas con los
			amigos son lo que m&aacute;s se disfruta. Me gusta la estrategia del juego y la mejora a lo largo del partido
			por parte de los equipos. Adem&aacute;s, ver partidos de la liga de campeones donde juega el Real Madrid es uno de mis
			mayores gustos</p>
			
			
			<h2>2. Gimnasio</h2>
			<img src="imagenes/gym.jpg" alt="Imagengym" id="gym1" width=100% height= auto>
			<p>Ir al gimnasio es una parte fundamental de mi vida. Me gustan los entrenamientos de fuerza y acondicionamiento 
			f&iacute;sico. Disfruto mi rutina diaria, aprender sobre biomec&aacute;nica y nutrici&oacute;n para optimizar mi rendimiento, y superar 
			mis propios l&iacute;mites. M&iacute;s all&aacute; de los beneficios f&iacute;sicos, el gimnasio es tambi&eacute;n un espacio de 
			disciplina y enfoque mental, donde me desconecto del mundo y me concentro en mis objetivos personales.
			
			<h2>3. Naturaleza</h2>
			<img src="imagenes/naturaleza.jpg" alt="Imagennatu" id="natu1" width=100% height= auto>
			<p>Cuando tengo la oportunidad, me gusta salir a caminar por la naturaleza, explorar monta&ntilde;as y respirar aire fresco. 
			El senderismo me permite desconectarme del estr&eacute;s diario y disfrutar del paisaje, 
			adem&aacute;s de ser un excelente complemento para mantenerme en forma.</p>
			
			<h2>4. Tecnolog&iacute;a y Programaci&oacute;n</h2>
			<img src="imagenes/programacion.jpg" alt="Imagenprog" id="prog1" width=100% height= auto>
			<p>La tecnolog&iacute;a me fascina, y en mis tiempos libres me gusta experimentar con software, aprender sobre programaci&oacute;n 
			y explorar nuevas herramientas digitales. Ya sea desarrollando peque&ntilde;os proyectos o simplemente curioseando sobre 
			avances tecnol&oacute;gicos, siempre encuentro algo interesante en este mundo.</p>
        </section>
           
     
    </main>
    <footer class="footer" >
        <div class="cabecera">
            <p>Video</p>
           
        </div>
    </footer>

    <script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
    <script src="../scripts.js"></script>
 </body>
 
</html>